# PathReinSpanSymbol Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathReinSpanSymbol Class
Members See Also
---
Represents a Path Reinforcement Span Symbol element in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PathReinSpanSymbol : IndependentTag
```

Visual Basic
---
```text
Public Class PathReinSpanSymbol _
	Inherits IndependentTag
```

Visual C++
---
```text
public ref class PathReinSpanSymbol : public IndependentTag
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..IndependentTag Autodesk.Revit.DB.Structure..::..PathReinSpanSymbol
# See Also
PathReinSpanSymbol Members
Autodesk.Revit.DB.Structure Namespace